---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.JoinedRoofMissesTargetError
source: html/d909f8d2-33e0-6a5c-2ee3-f1d8044db819.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.JoinedRoofMissesTargetError Property

Part of the roof to be joined misses the target face.

## Syntax (C#)
```csharp
public static FailureDefinitionId JoinedRoofMissesTargetError { get; }
```